/*
Наталья, привет!
Спасибо за комментарии, я действительно немного запутался в условии и подсказках к ТЗ.
Конкретно эта фраза: "не существует отдельного метода, который занимался бы только обновлением статуса задачи.
Вместо этого статус задачи обновляется вместе с полным обновлением задачи", потому и не стал создавать метод
для изменения статуса. С точки зрения логики приложения это конечно ошибка, но видимо я не так понял подсказку.
*/
public class Main {
    public static void main(String[] args) {

    }
}

