/*
Наталья, привет!
По поводу циклов, которые я использовал в update методах: мне изначально из условий показалось, что в main вообще
ничего не должно происходить кроме получения объекта из фронта.
По условию задачи ИД должно устанавливаться при создании задачи, я решил, что имеется в виду метод create. Но при
обновлении объекта вызывается метод update. "Новая версия объекта с верным идентификатором передаются в виде параметра",
это меня смутило, так как передается новый (new) объект класса задачи, а у него изначально ид равно 0, поэтому я
устанавливал его в методе. По той же причине в createNewSubtask передавал эпик.
Хотел узнать, правильно ли я называю коммиты?
*/
public class Main {
    public static void main(String[] args) {

    }
}

